import React, {Component} from 'react';

class Introduction extends Component {
    render() {
        return (
            <div className="introduction">
                <div class="introduction-title">
                    Ознакомление
                </div>
                {/*•	во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не допускается частичный или полный уход из поля видимости камеры;*/}
                {/*•	на фоне не должно быть голосов или шума;*/}
                {/*•	прохождение экзамена должно осуществляться в приложении, нельзя переключаться на другие приложения или сворачивать приложение, нельзя открывать сторонние вкладки (страницы);*/}
                {/*•	запрещается записывать каким-либо образом материалы и содержимое экзамена, а также передавать их третьим лицам;*/}
                {/*•	запрещается пользоваться звуковыми, визуальными или какими либо еще подсказками;*/}
                {/*•	в комнате не должно находиться других людей;*/}
                {/*•	после завершения экзамена проверьте все ответы и распишитесь на экране;*/}
                {/*•	обязательно дождитесь полной отправки ответов, так как ответственность за отправку файлов несет обучающийся;*/}
                {/*•	в случае нарушения экзаменационных требований со стороны обучающихся в ходе тестирования рассматриваются меры по снижению или отмене баллов по предмету:*/}
                {/*1.	Если показатель соответствия фотоизображения студента при тестировании и фотоизображения при регистрации ниже 80% результат экзамена аннулируется.*/}
                {/*2.	Если в ходе сдачи теста будут выявлены посторонние звуки, то за каждую минуту из общего результата будет отниматься 2 балла (от 1 до 5 минут). В случае если, более 5 минут, то результат экзамена аннулируется.*/}
                {/*3.	Если будут выявлены факты совместной сдачи экзамена (определяется по геолокации места сдачи экзамена студентом), то результат экзамена аннулируется.*/}

                <div class="introduction-conditions">
                    <ul class="introduction-conditions__list">
                        {/*<li class="introduction-conditions__item">*/}
                        {/*    •	во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        {/*<li className="introduction-conditions__item">*/}
                        {/*    • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не*/}
                        {/*    допускается частичный или полный уход из поля видимости камеры;*/}
                        {/*</li>*/}
                        <li class="introduction-conditions__item">
                            • во время экзамена запрещается покидать кадр, голова должна полностью помещаться в кадр, не
                            допускается частичный или полный уход из поля видимости камеры;<br/>
                            • на фоне не должно быть голосов или шума;<br/>
                            • прохождение экзамена должно осуществляться в приложении, нельзя переключаться на другие
                            приложения или сворачивать приложение, нельзя открывать сторонние вкладки (страницы);<br/>
                            • запрещается записывать каким-либо образом материалы и содержимое экзамена, а также
                            передавать их третьим лицам;<br/>
                            • запрещается пользоваться звуковыми, визуальными или какими либо еще подсказками;<br/>
                            • в комнате не должно находиться других людей;<br/>
                            • после завершения экзамена проверьте все ответы и распишитесь на экране;<br/>
                            • обязательно дождитесь полной отправки ответов, так как ответственность за отправку файлов
                            несет обучающийся;<br/>
                            • в случае нарушения экзаменационных требований со стороны обучающихся в ходе тестирования
                            рассматриваются меры по снижению или отмене баллов по предмету:<br/>
                            1. Если показатель соответствия фотоизображения студента при тестировании и фотоизображения
                            при регистрации ниже 80% результат экзамена аннулируется.<br/>
                            2. Если в ходе сдачи теста будут выявлены посторонние звуки, то за каждую минуту из общего
                            результата будет отниматься 2 балла (от 1 до 5 минут). В случае если, более 5 минут, то
                            результат экзамена аннулируется.<br/>
                            3. Если будут выявлены факты совместной сдачи экзамена (определяется по геолокации места
                            сдачи экзамена студентом), то результат экзамена аннулируется.<br/>
                        </li>
                    </ul>
                </div>
                <div class="introduction-confirm">
                    {/*<input className="hidden-input" type="checkbox" id = "condition-confirm-input"/>*/}
                    {/*<label className="input-custom-container" htmlFor="condition-confirm-input">*/}
                    {/*    <span className="confirm-input-custom"></span>*/}
                    {/*    <span className= "Я согласен с условиями работы сервиса"></span>*/}
                    {/*</label>*/}
                    <input type="checkbox" className="input-introduction-confirm"/>
                    <p class="introduction-input-confirm-text">Я согласен с условиями работы сервиса</p>
                </div>
                <div class="introduction-next">
                    <button class="introduction-next-button">Далее</button>
                </div>
            </div>
        );
    }
}

export default Introduction;